HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCcu6_regdef.h
/** \\brief  Capture/Compare Register for Channel CC60 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC60R_Bits B;
} Ifx_CCU6_CC60R;

/** \\brief  Capture/Compare Shadow Reg. for Channel CC60 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC60SR_Bits B;
} Ifx_CCU6_CC60SR;

/** \\brief  Capture/Compare Register for Channel CC61 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC61R_Bits B;
} Ifx_CCU6_CC61R;

/** \\brief  Capture/Compare Shadow Reg. for Channel CC61 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC61SR_Bits B;
} Ifx_CCU6_CC61SR;

/** \\brief  Capture/Compare Register for Channel CC62 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC62R_Bits B;
} Ifx_CCU6_CC62R;

/** \\brief  Capture/Compare Shadow Reg. for Channel CC62 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC62SR_Bits B;
} Ifx_CCU6_CC62SR;

/** \\brief  Compare Register for T13 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC63R_Bits B;
} Ifx_CCU6_CC63R;

/** \\brief  Compare Shadow Register for T13 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CC63SR_Bits B;
} Ifx_CCU6_CC63SR;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CLC_Bits B;
} Ifx_CCU6_CLC;

/** \\brief  Compare State Modification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CMPMODIF_Bits B;
} Ifx_CCU6_CMPMODIF;

/** \\brief  Compare State Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_CMPSTAT_Bits B;
} Ifx_CCU6_CMPSTAT;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_ID_Bits B;
} Ifx_CCU6_ID;

/** \\brief  Interrupt Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_IEN_Bits B;
} Ifx_CCU6_IEN;

/** \\brief  Input Monitoring Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_IMON_Bits B;
} Ifx_CCU6_IMON;

/** \\brief  Interrupt Node Pointer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_INP_Bits B;
} Ifx_CCU6_INP;

/** \\brief  Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_IS_Bits B;
} Ifx_CCU6_IS;

/** \\brief  Interrupt Status Reset Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_ISR_Bits B;
} Ifx_CCU6_ISR;

/** \\brief  Interrupt Status Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_ISS_Bits B;
} Ifx_CCU6_ISS;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_KRST0_Bits B;
} Ifx_CCU6_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_KRST1_Bits B;
} Ifx_CCU6_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_KRSTCLR_Bits B;
} Ifx_CCU6_KRSTCLR;

/** \\brief  Kernel State Control Sensitivity Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_KSCSR_Bits B;
} Ifx_CCU6_KSCSR;

/** \\brief  Lost Indicator Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_LI_Bits B;
} Ifx_CCU6_LI;

/** \\brief  Module Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_MCFG_Bits B;
} Ifx_CCU6_MCFG;

/** \\brief  Multi-Channel Mode Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_MCMCTR_Bits B;
} Ifx_CCU6_MCMCTR;

/** \\brief  Multi-Channel Mode Output Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_MCMOUT_Bits B;
} Ifx_CCU6_MCMOUT;

/** \\brief  Multi-Channel Mode Output Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_MCMOUTS_Bits B;
} Ifx_CCU6_MCMOUTS;

/** \\brief  Modulation Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_MODCTR_Bits B;
} Ifx_CCU6_MODCTR;

/** \\brief  CCU60 Module Output Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_MOSEL_Bits B;
} Ifx_CCU6_MOSEL;

/** \\brief  OCDS Control and Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_OCS_Bits B;
} Ifx_CCU6_OCS;

/** \\brief  Port Input Select Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_PISEL0_Bits B;
} Ifx_CCU6_PISEL0;

